{"backend": "tensorflow", "config": [{"config": {"bias_regularizer": null, "kernel_regularizer": null, "name": "dense_1", "activity_regularizer": null, "units": 1, "activation": "linear", "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 1], "bias_constraint": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true}, "class_name": "Dense"}], "keras_version": "2.0.8", "class_name": "Sequential"}