{"config": [{"config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_1", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "batch_input_shape": [null, 1], "use_bias": true, "dtype": "float32", "units": 1, "activity_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.0.8", "backend": "tensorflow", "class_name": "Sequential"}